Documents/Договор.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Договор</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ПродажиТуров</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСКлиентами</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Соглашение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПредварительноеСоглашение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Агент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Агенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтранаПосещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПоездки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеПоездки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоУчастников</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>УчастникиПоездки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФИО</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>МаршрутПоездки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ГородаМира</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Гостиница</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Отели</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидНомера</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыНомеровГостиниц</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/Договор/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура СоглашениеПриИзменении(Элемент)
    Если Объект.Соглашение = Неопределено Тогда
        Возврат;
    КонецЕсли;
    ЗаполнитьИзСоглашенияНаСервере();
    
    // Применяем фильтр для городов по стране
    МаршрутПоездкиГородНачалоВыбора(Элементы.МаршрутПоездкиГород, Неопределено, Неопределено);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИзСоглашенияНаСервере()
    Если Объект.Соглашение = Неопределено Тогда
        Возврат;
    КонецЕсли;
    
    СоглашениеОбъект = Объект.Соглашение.ПолучитьОбъект();
    Если СоглашениеОбъект = Неопределено Тогда
        Возврат;
    КонецЕсли;
    
    // 1. Заполняем шапку договора данными из соглашения
    Объект.Организация = СоглашениеОбъект.Организация;
    Объект.Агент = СоглашениеОбъект.Агент;
    Объект.Клиент = СоглашениеОбъект.Клиент;
    Объект.СтранаПосещения = СоглашениеОбъект.СтранаПосещения;
    Объект.НачалоПоездки = СоглашениеОбъект.НачалоПоездки;
    Объект.ОкончаниеПоездки = СоглашениеОбъект.ОкончаниеПоездки;
    Объект.КоличествоУчастников = СоглашениеОбъект.КоличествоУчастников;
    
    // 2. Очищаем и заполняем маршрут поездки городами из соглашения
    Объект.МаршрутПоездки.Очистить();
    Для каждого СтрокаСоглашения Из СоглашениеОбъект.ГородаПосещения Цикл
        НоваяСтрока = Объект.МаршрутПоездки.Добавить();
        НоваяСтрока.Город = СтрокаСоглашения.Город;
        
        // 3. Подставляем даты из шапки в каждую строку маршрута
        НоваяСтрока.ДатаНачала = Объект.НачалоПоездки;
        НоваяСтрока.ДатаОкончания = Объект.ОкончаниеПоездки;
    КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура МаршрутПоездкиГородНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
    // Если элемент не передан — выходим
    Если Элемент = Неопределено Тогда
        Возврат;
    КонецЕсли;
    
    Если ЗначениеЗаполнено(Объект.СтранаПосещения) Тогда
        НовыйОтбор = Новый ПараметрВыбора("Отбор.Страна", Объект.СтранаПосещения);
        МассивПараметров = Новый Массив;
        МассивПараметров.Добавить(НовыйОтбор);
        Элемент.ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметров);
    Иначе
        Элемент.ПараметрыВыбора = Новый ФиксированныйМассив(Новый Массив);
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура МаршрутПоездкиГородОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
    СтандартнаяОбработка = Ложь;
    ТекущиеДанные = Элементы.МаршрутПоездки.ТекущиеДанные;
    Если ТекущиеДанные = Неопределено Тогда
        Возврат;
    КонецЕсли;
    ТекущиеДанные.Город = ВыбранноеЗначение;
КонецПроцедуры

&НаКлиенте
Процедура СтранаПосещенияПриИзменении(Элемент)
    // Очищаем города и гостиницы в маршруте
    Для каждого Строка Из Объект.МаршрутПоездки Цикл
        Строка.Город = Неопределено;
        Строка.Гостиница = Неопределено;
    КонецЦикла;
    
    // Применяем фильтр для городов по стране
    МаршрутПоездкиГородНачалоВыбора(Элементы.МаршрутПоездкиГород, Неопределено, Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура МаршрутПоездкиГородПриИзменении(Элемент)
    ТекущиеДанные = Элементы.МаршрутПоездки.ТекущиеДанные;
    Если ТекущиеДанные = Неопределено Тогда
        Возврат;
    КонецЕсли;
    
    Если ТекущиеДанные.Город = Неопределено Тогда
        Возврат;
    КонецЕсли;
    
    // Подставляем даты из шапки, если не заполнены
    Если ТекущиеДанные.ДатаНачала = '00010101' Тогда
        ТекущиеДанные.ДатаНачала = Объект.НачалоПоездки;
    КонецЕсли;
    
    Если ТекущиеДанные.ДатаОкончания = '00010101' Тогда
        ТекущиеДанные.ДатаОкончания = Объект.ОкончаниеПоездки;
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура МаршрутПоездкиГостиницаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
    ТекущиеДанные = Элементы.МаршрутПоездки.ТекущиеДанные;
    Если ТекущиеДанные = Неопределено Тогда
        Возврат;
    КонецЕсли;
    
    Если ЗначениеЗаполнено(ТекущиеДанные.Город) Тогда
        НовыйОтбор = Новый ПараметрВыбора("Отбор.Город", ТекущиеДанные.Город);
        МассивПараметров = Новый Массив;
        МассивПараметров.Добавить(НовыйОтбор);
        Элемент.ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметров);
    Иначе
        Элемент.ПараметрыВыбора = Новый ФиксированныйМассив(Новый Массив);
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
	
	// Формируем массив из текущего документа
	МассивДокументов = Новый Массив;
	МассивДокументов.Добавить(Объект.Ссылка);
	
	// Получаем сформированный табличный документ с сервера
	ТабДок = ПечатьНаСервере(МассивДокументов);
	
	// Показываем табличный документ пользователю (СТРОГО НА КЛИЕНТЕ)
	Если ТабДок <> Неопределено Тогда
		ТабДок.Показать("Печатная форма договора");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПечатьНаСервере(МассивДокументов)
	
	// Получаем объект из ссылки, чтобы у него стал доступен метод Печать()
	ДокОбъект = МассивДокументов[0].ПолучитьОбъект();
	
	Возврат ДокОбъект.Печать(МассивДокументов);
	
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Объект.ПометкаУдаления Тогда
		
		// Блокируем все поля
		Для каждого ТекЭлемент Из Элементы Цикл
			Если ТипЗнч(ТекЭлемент) = Тип("ПолеФормы") Тогда
				ТекЭлемент.Доступность = Ложь;
			КонецЕсли;
		КонецЦикла;
		
		// Блокируем кнопки
		Если Элементы.Найти("Записать") <> Неопределено Тогда
			Элементы.Записать.Доступность = Ложь;
		КонецЕсли;
		Если Элементы.Найти("Провести") <> Неопределено Тогда
			Элементы.Провести.Доступность = Ложь;
		КонецЕсли;
		
		// ПОКАЗЫВАЕМ КРАСНУЮ НАДПИСЬ
		Элементы.ДекорацияПометкаУдаления.Видимость = Истина;
		
	Иначе
		
		// СКРЫВАЕМ НАДПИСЬ
		Элементы.ДекорацияПометкаУдаления.Видимость = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры
